EnKF-Training-codes/foam_base/case1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "2000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
31383
(
(4.93355 0.00669091 0)
(5.1998 5.57493e-06 0)
(14.739 0.0200651 0)
(5.01214 1.16595e-06 0)
(15.672 3.91579e-06 0)
(24.6015 0.0335404 0)
(4.86954 -5.09318e-06 0)
(15.106 5.99662e-06 0)
...
)
;

boundaryField
{
    base
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (570.7 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform (570.7 0 0);
    }
}


// ************************************************************************* //
