EnKF-Training-codes/foam_base/case1/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
1.83607e+10
1.83838e+10
3.02112e+09
1.84029e+10
3.14531e+09
1.02499e+09
1.84108e+10
3.14872e+09
...
)
;

boundaryField
{
    base
    {
        type            omegaWallFunction;
        blending        binomial2;
        n               2;
        beta1           0.075;
        value           nonuniform List<scalar> 
317
(
1.83607e+10
1.83838e+10
1.84029e+10
1.84108e+10
1.84133e+10
1.84171e+10
1.84229e+10
1.84265e+10
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 6e+06;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform 6e+06;
    }
}


// ************************************************************************* //
