EnKF-Training-codes/foam_base/case1/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
0.30191
0.301468
0.302414
0.301149
0.301891
0.303
0.301015
0.301554
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
0.301677
0.301298
0.300985
0.300857
0.300815
0.300753
0.300659
0.3006
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.821243;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.33624
1.29352
1.27723
1.27829
1.23059
1.29425
1.2254
1.32259
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.821243;
    }
}


// ************************************************************************* //
