EnKF-Training-codes/foam_base/case1/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<vector> 
317
(
(-170.794 -0.32248 0)
(-180.011 -0.000253814 0)
(-173.514 -7.20126e-05 0)
(-168.578 0.000220682 0)
(-164.909 -6.89325e-05 0)
(-161.92 -0.000307953 0)
(-159.371 -0.000177762 0)
(-157.191 9.35498e-05 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
