EnKF-Training-codes/foam_base/case1/0/xx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      xx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
7.55882e-07
8.39509e-07
7.46719e-07
7.78632e-07
1.5894e-06
1.38422e-06
7.33964e-07
1.45958e-06
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.395609;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
3.14146e-05
0.000147114
0.00171784
0.0119206
0.0500454
0.17107
0.346868
0.688852
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.395609;
    }
}


// ************************************************************************* //
